[
  {
    "tweet_id": "Unknown",
    "timestamp": "2022-04-24T09:12:30.000Z",
    "text": "Steal this idea. Finetune a language model (like GPT3) on chats/conversations with your loved ones to \"immortalize\" their style forever, so that you can continue chatting with them even after they're no more.",
    "replies": 27,
    "retweets": 27,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2022-05-02T03:10:56.000Z",
    "text": "Steal this idea. An accountability coach that you can hire to help you finish difficult self-initiated projects. The coach calls you everyday to check your progress and reminds you why you started the project.",
    "replies": 25,
    "retweets": 25,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2024-01-04T07:22:03.000Z",
    "text": "Steal this idea: horror movie set in a cinema hall",
    "replies": 7,
    "retweets": 7,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2021-07-24T11:59:57.000Z",
    "text": "Steal this idea. A website that gives one new project challenge daily that doesn’t any digital screens, can be done within 60-90 minutes and only requires easily available materials. Bonus points if you enable project takers to submit photos / videos of their creations.",
    "replies": 8,
    "retweets": 8,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2025-03-25T08:30:00.000Z",
    "text": "Steal this idea. A LinkedIn alternative where companies message you about your work, and you publish them with your answers Put semantic search on it, so that over them your *real* work gets discovered in terms of what companies actually want instead of what you think they want",
    "replies": 34,
    "retweets": 34,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2019-08-23T10:50:47.000Z",
    "text": "Steal this idea: a website where short anecdotes and (real life) stories all imaginable topics are curated. Useful for writers and presenters to discover and include stories that make dry facts and thoughts interesting to the audience.",
    "replies": 3,
    "retweets": 3,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2021-07-20T14:22:13.000Z",
    "text": "Amazing essay on why most ideas are brilliant but worthless. https://stonemaiergames.com/kickstarter-lesson-204-your-idea-is-brilliant-your-idea-is-worthless/…",
    "replies": 5,
    "retweets": 5,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2025-03-24T14:30:00.000Z",
    "text": "Steal this idea: an AI that shadows the top 0.1% talent in a field as they work and do decision making. The talent can then license the AI model to different companies as their own official extension.",
    "replies": 52,
    "retweets": 52,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2016-05-17T08:15:32.000Z",
    "text": "There should be a Wordpress plugin where you can pay people to edit blog post and suggest how to improve the writing. #steal #this #idea pl",
    "replies": 4,
    "retweets": 4,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2017-03-19T05:02:22.000Z",
    "text": "Steal this idea -> a social network where 80% ad money goes to charities of users' choice.",
    "replies": 2,
    "retweets": 2,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2024-10-28T15:18:13.000Z",
    "text": "Steal this idea: take top AI papers and automatically derive interactive visualizations / toy implementations of key ideas in an integrated notebook. Convert static papers into interactive python notebooks that readers can play along to understand the key innovations.",
    "replies": 5,
    "retweets": 5,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2017-11-06T01:41:59.000Z",
    "text": "Steal this idea: fork of Postgres where missing values are automatically and continuously filled by ML without extra effort from user",
    "replies": 0,
    "retweets": 0,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2025-02-24T13:26:59.000Z",
    "text": "You should only work on ideas that you can’t stop thinking about, and can’t help constantly tweak to make them 1% better. (Otherwise you’ll be beaten by those who do)",
    "replies": 35,
    "retweets": 35,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2021-03-29T05:11:44.000Z",
    "text": "Steal successful ideas from everywhere. (a thread on this mental model) 14th chapter of my book: https://invertedpassion.com/steal-successful-ideas-from-everywhere/…",
    "replies": 4,
    "retweets": 4,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2025-01-18T18:08:30.000Z",
    "text": "Getting a brilliant idea is the easy part. What’s rare is having the vision to see its full potential and then actually dedicating a decade of your life to realise it.",
    "replies": 12,
    "retweets": 12,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2021-06-30T12:29:49.000Z",
    "text": "The number 1 hack for career growth is to own an area of business so completely that your boss forgets that it’s even there.",
    "replies": 21,
    "retweets": 21,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2025-02-02T11:33:19.000Z",
    "text": "Whenever you get an impossible-sounding idea, nurture it. History teaches us that as the time goes on, world’s possibility space keeps on expanding. If you do this, when the time is right, you would be in a position to see what’s possible now that everyone thinks is impossible",
    "replies": 15,
    "retweets": 15,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2025-03-30T07:39:00.000Z",
    "text": "The basics are utterly simple Build something that’s better than what people use, tell them how it is better and then add value in your conversations to them (so that they trust you enough to find what you’re upto, thereby discovering your product)",
    "replies": 1,
    "retweets": 1,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2025-03-05T03:13:23.000Z",
    "text": "Stumbling upon one worthy problem to solve is much more valuable than having lots of ideas. But the path to discovering good problems goes via being immersed in a pool full of ideas.",
    "replies": 21,
    "retweets": 21,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2021-12-07T05:55:02.000Z",
    "text": "Tip for new founders: as soon as you're able to afford it, hire an executive assistant. Your mental bandwidth is the biggest chokepoint and leverage for growth. Delegate everything that others can do equivalent or better than you so you end up owning as few things as possible.",
    "replies": 18,
    "retweets": 18,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2024-10-05T02:58:29.000Z",
    "text": "If you have an idea for something new, don’t tell it to anyone until you’ve put in a non-trivial amount of effort into it. Ideas dopamine hits upfront, so if the only thing you’re doing is talking about it and not acting out, you’ll sap out your motivation to act quickly.",
    "replies": 12,
    "retweets": 12,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2020-08-14T09:14:18.000Z",
    "text": "Early in your startup adventure, don’t get influenced by your sunk cost. Be ready to throw all your previous effort, if you find a genuinely new insight or a ray of hope. Your first version will likely not have any product-market fit, so don’t remain constrained by it.",
    "replies": 7,
    "retweets": 7,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2025-03-27T02:54:21.000Z",
    "text": "Take up a physical space, have people with similar interests work from there, people explore what they are most curious about and teach each other what they learn. Plus, they do internships on the side. Who guides them? Internet and peers.",
    "replies": 3,
    "retweets": 3,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2022-07-30T14:03:28.000Z",
    "text": "Idea: a digital detox phone. Black and white screen, blackberry style physical keyboard, App Store that excludes social media, camera but no gallery, and a new App Store that lets you buy physical objects as substitutes to apps (comic books, letters, magazines)",
    "replies": 27,
    "retweets": 27,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2024-11-05T05:17:25.000Z",
    "text": "You should never worry about giving out your ideas. Either your idea is bad and you benefit from feedback. Or your idea is good and you gain credibility. Have trust that if you have one good idea, you can have many more good ideas. Modern moat is speed, not resting on laurels.",
    "replies": 18,
    "retweets": 18,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2020-10-06T14:53:33.000Z",
    "text": "If you’re an aspiring founder, wait for the right idea to strike that has a viable path to distribution. So many good ideas never work out because it’s unprofitable to get the product in front of people who want it.",
    "replies": 8,
    "retweets": 8,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2023-12-07T17:15:21.000Z",
    "text": "'People will \"steal your idea\", but only once it has proven to make a lot of money. In which case, you have already made a lot of money.' Reddit never fails to impress with its wisdom!",
    "replies": 10,
    "retweets": 10,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2025-04-05T10:16:16.000Z",
    "text": "Idea: Deep Tank. It’s like Shark Tank but for deep tech startups. Will give exposure to few that are actually doing innovative tech in India + inspire many others to attempt the same. If this were to happen, who should be on the judges?",
    "replies": 92,
    "retweets": 92,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2020-01-04T03:45:48.000Z",
    "text": "The startup advice “make something that people want” is not exactly right. People want lots of things - including going to the moon. The more practical advice is “MAKE SOMETHING PEOPLE WILL PAY FOR” because then you’ll end up optimising for real intent and not just an idle wish.",
    "replies": 30,
    "retweets": 30,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2023-07-04T03:59:29.000Z",
    "text": "The key to having good ideas is to first produce lots of bad ideas.",
    "replies": 23,
    "retweets": 23,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2022-06-08T05:23:50.000Z",
    "text": "I’ve noticed that most people who’ve never attempted a startup are secretive about their business ideas. They need to realise that it’s a vicious cycle: if they never discuss their ideas openly, they’ll never be able to do a startup.",
    "replies": 35,
    "retweets": 35,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2024-07-07T08:44:22.000Z",
    "text": "Idea: a Goodreads like platform where you add the books you read and it generates quizzes for you to help remember important ideas in them (via spaced repetition). This can be easily bootstrapped via LLMs, especially for popular books.",
    "replies": 56,
    "retweets": 56,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2025-03-25T02:30:00.000Z",
    "text": "Founders, here's a tip: When you schedule a meeting with someone for feedback, don't pitch. Just pose what you're struggling with, and let others share their perspective. You'd waste an opportunity to learn if you're trying to pitch and paint a rosy picture.",
    "replies": 19,
    "retweets": 19,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2022-02-23T15:00:13.000Z",
    "text": "Startup idea: on-demand, pay-per-minute lawyers to consult if ever state authorities or police harasses you or if you have a basic legal query on anything. I would totally keep such an app on my phone.",
    "replies": 60,
    "retweets": 60,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2021-10-07T02:22:44.000Z",
    "text": "Idea: a virtual campus where you can walk around (like in a game) with rooms where anyone can teach whatever they like to others. It’ll be like a real university campus, except online and massively open.",
    "replies": 31,
    "retweets": 31,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2021-08-28T06:36:17.000Z",
    "text": "Idea: a website that curates books written for the general audience by professors and researchers at top universities. I've consistently found such books to have an insane value-for-invested time.",
    "replies": 18,
    "retweets": 18,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2020-05-08T14:01:09.000Z",
    "text": "If you’re graduating this year and aren’t able to find a job, build and sell a product / side project You’ll gain real world experience of how the world works + you create optionality for yourself: succeeds ==> financial independence fails ==> edge over other candidates",
    "replies": 7,
    "retweets": 7,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2022-06-11T06:07:30.000Z",
    "text": "If you’re a startup, decide to be all-remote from the get go. You will be able to hire all the talented folks across the world who’re frustrated because their current company is ending work-from-home and calling everyone to the office.",
    "replies": 15,
    "retweets": 15,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2022-03-01T14:23:04.000Z",
    "text": "If you haven’t started a company so far because you’re unable to find a good business idea, you’re doing it fine. Most business ideas point either to commodity profits or non-existent market need. Ideas with potential for being large companies are extremely non-trivial.",
    "replies": 11,
    "retweets": 11,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2022-02-02T05:24:46.000Z",
    "text": "Most ideas are inevitable because they build upon what’s already discovered or built by others. The skill of a creator then is to select an idea whose time has come instead of pursuing an “original” idea that’s either too late or too soon to be viable.",
    "replies": 9,
    "retweets": 9,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2025-02-11T15:47:20.000Z",
    "text": "Ideas on the whole have a bigger leverage than capital. Imagine bitcoin, pagerank, e=mc2, transformer. the funny thing is that anyone can think of such ideas and mobilise them from anywhere in the world, requiring very little upfront capital.",
    "replies": 27,
    "retweets": 27,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2025-02-13T12:30:00.000Z",
    "text": "Knowledge has a tendency to spread, so it’s an unreliable source of moat. So the only edge you have is a slight head start. After that either you keep innovating like crazy to stay ahead, or translate temporary edge into enduring moats with distribution, partnerships, etc.",
    "replies": 13,
    "retweets": 13,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2022-09-26T03:13:25.000Z",
    "text": "Here's an idea for a digital detox app. You load some money into it every month and every hour you don't use the phone, you get some money back. At the end of the month, with the accumulated money, you're sent a physical object to keep busy with (book, board game, puzzle).",
    "replies": 12,
    "retweets": 12,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2024-04-08T04:58:23.000Z",
    "text": "If you’re struggling to get startup ideas; try this method: • Think of areas where you’re above average (vs other entrepreneurs) • Write commonly held beliefs in those areas • Write your differentiated / contrarian beliefs in the same areas • Think of what’s become",
    "replies": 7,
    "retweets": 7,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2024-08-15T04:33:57.000Z",
    "text": "A good way to generate lots of ideas: Ask yourself “what should exist but doesn’t” and then write at least 10 ideas in an unconstrained fashion.",
    "replies": 12,
    "retweets": 12,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2021-09-10T02:37:08.000Z",
    "text": "If you’re a creative person, always be involved with two or more projects at the same time. When your motivation runs out for a project, you can instantly pick a different one. This ensures that your momentum never runs out.",
    "replies": 9,
    "retweets": 9,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2024-11-15T04:14:06.000Z",
    "text": "The only way to escape this trap is to make good work a habit, and do it for its own sake (any attention from the world ought to be a welcome surprise, not an expectation)",
    "replies": 3,
    "retweets": 3,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2022-10-12T11:47:10.000Z",
    "text": "Never ask your friends or family if they like your idea. a",
    "replies": 10,
    "retweets": 10,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2025-02-28T03:30:00.000Z",
    "text": "What I love about entrepreneurship is that you don't need anyone's permission or approval to do things. You can just do things! The real signal of value comes from the world at large, and not any specific individual.",
    "replies": 30,
    "retweets": 30,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2025-01-25T04:30:02.000Z",
    "text": "Bootstrapper’s mantra: the nimble eat the lunch of the mighty. In other words, more resources aren’t always strictly better than fewer resources.",
    "replies": 18,
    "retweets": 18,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2025-02-11T09:01:04.000Z",
    "text": "Idea: a service that crawls my WhatsApp contacts and groups, and builds a searchable dashboard of my network. I should be able to type a problem I’m facing and it should pop up who from my network can help.",
    "replies": 120,
    "retweets": 120,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2019-12-26T05:10:45.000Z",
    "text": "Do you struggle to start projects? Here’s a tip: initially you’ll absolutely suck at it. Starting is always high effort, low returns. What you need is habit formation to help you sail to joyous phase. So initially just focus on frequency of action and not quantity or quality.",
    "replies": 8,
    "retweets": 8,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2021-06-30T03:18:31.000Z",
    "text": "Don’t get addicted to working hard. Get addicted to getting what you want with as minimum effort as possible. Life is to be enjoyed, and not to be drowned in toil.",
    "replies": 30,
    "retweets": 30,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2020-03-07T05:14:05.000Z",
    "text": "Startup idea: a helpline for people in their 20s to give them basic financial literacy. Just avoiding basic mistakes in 20s (like keeping everything in savings or buying a house or settling at a low salary) can make people substantially richer in life.",
    "replies": 89,
    "retweets": 89,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2021-09-23T04:07:19.000Z",
    "text": "Young people should attempt doing a startup because they don’t have much to lose, making them fearless. And they’re inexperienced enough to not play by the established rules of the market, making them original.",
    "replies": 32,
    "retweets": 32,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2024-09-22T12:30:02.000Z",
    "text": "Want to not get bored in life? Take a highly ambitious project. Don’t see a point in it? Remind yourself that it’s to prevent getting bored. Not making enough progress? Well, that’s expected as it’s ambitious.",
    "replies": 19,
    "retweets": 19,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2025-01-28T12:49:58.000Z",
    "text": "If you're a founder pitching your idea to investors via cold messages, keep it crisp (1 line) and attach a link to a demo that shows value instantly. Nobody reads PDF slides anymore. Nobody cares about your long story in a cold email.",
    "replies": 35,
    "retweets": 35,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2022-03-30T08:02:37.000Z",
    "text": "I think early stage founders should create a pool in which 10-20 other similar staged/valued founders contribute their shares. VCs hedge their bets by investing in a portfolio. Founders should also hedge (partially) by doing these share-swaps with a common pool of startups.",
    "replies": 24,
    "retweets": 24,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2025-01-05T10:30:00.000Z",
    "text": "The cruel irony of the world is that you become successful by caring about what other people want, but if you do that long enough, you forget who you truly are.",
    "replies": 17,
    "retweets": 17,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2020-05-26T17:18:17.000Z",
    "text": "If there’s only 1 design principle you remember, let it be this: the amount of effort perfecting something should be directly proportional to how frequently it’s encountered by the user. Little annoyances multiply into hate over time. Little pleasures multiply into love.",
    "replies": 3,
    "retweets": 3,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2022-06-23T07:10:36.000Z",
    "text": "My top hiring hack is to give people a mini-project that's open-ended in nature and has no \"correct\" answer. This helps me select people who demonstrate good judgment under ambiguous instructions (by asking clarifying questions or by using creative ways of solving the problem).",
    "replies": 10,
    "retweets": 10,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2022-07-31T03:54:50.000Z",
    "text": "Step 1: find a big problem to solve in the world. Step 2: create new value in the world by solving the problem. Step 3: make a ton of money from it and give most of it away to important problems capitalism can’t solve for.",
    "replies": 6,
    "retweets": 6,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2023-01-27T12:24:27.000Z",
    "text": "If you're an information-addict, you're probably no better than the information-poor at generating novel ideas. Creativity requires both - inputs and a mental space to explore how those inputs combine. Don't just consume nonstop, pause and create too.",
    "replies": 11,
    "retweets": 11,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2024-03-30T06:12:59.000Z",
    "text": "As a startup founder, don’t just ask: “what do people want?” People want a lot of things - more money, better health, sleep, love, and so on. Rather ask: “is there a specific inefficiency that I can solve for that’s preventing people from getting what they want?”",
    "replies": 16,
    "retweets": 16,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2021-04-05T05:20:32.000Z",
    "text": "Great entrepreneurs have an instinct for efficient risk-taking. They: • First figure out the most expensive assumption for growth • Find the cheapest way to test that assumption • Obsessively create optionality of positive outcomes • Double down on realized positive outcomes",
    "replies": 3,
    "retweets": 3,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2024-07-03T04:37:28.000Z",
    "text": "Book idea: Summaries of what works well for different aspects of life (health, wealth, learning, career, etc) compiled from the highest quality evidence found in meta-reviews published in top journals. You read the book and you’re up to date on what works and what doesn’t.",
    "replies": 32,
    "retweets": 32,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2025-03-31T12:35:43.000Z",
    "text": "i would fire up lovable / bolt code one prototype each week engage with target users online and show them prototype 1-to-1 iterate very fast, and be okay to change directions on a monthly basis",
    "replies": 0,
    "retweets": 0,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2021-06-22T06:11:07.000Z",
    "text": "Idea: a Farmville type of game where when your veggies are ready to be harvested, you actually get them delivered at home.",
    "replies": 21,
    "retweets": 21,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2020-10-01T04:59:45.000Z",
    "text": "Those who're cognitively driven (eventually) learn a powerful lesson in their career. When it comes to professional growth, ideas come cheap and handy. It's the ability to get shit done that makes one valuable in an org. And that requires working with constraints.",
    "replies": 5,
    "retweets": 5,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2025-01-26T03:15:46.000Z",
    "text": "Happy Republic Day Just bought this beauty at the airport. Now time to make an institution of similar caliber for AI from India!",
    "replies": 84,
    "retweets": 84,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2023-02-05T08:44:20.000Z",
    "text": "The best use of your time is to do what is unique to you. If you’re pursuing an idea and are pretty sure it’ll happen *soon* with or without you, don’t do it. The world is at its greatest when everyone does what they’re best at.",
    "replies": 6,
    "retweets": 6,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2025-03-03T09:11:59.000Z",
    "text": "OpenAI's deep research is highly underrated for doing initial research on startup ideas. The way I use it: - Put in a framework that defines a good startup - Put in your initial idea - Ask for it to evaluate and expand your idea against the framework",
    "replies": 48,
    "retweets": 48,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2024-10-23T03:17:14.000Z",
    "text": "One of the most counterintuitive truths about startups is that trying to start a company never works out. What works out instead is building projects after projects, and not calling them startups until one of them takes off.",
    "replies": 25,
    "retweets": 25,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2024-09-20T04:41:44.000Z",
    "text": "Idea: Tinder for recipes. You swipe left and right on what you like, and over time the app figures out your taste to start recommending recipes that you’d like but would have never imagined.",
    "replies": 31,
    "retweets": 31,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2023-07-22T12:49:37.000Z",
    "text": "Idea for a Lock Screen: give me a new (medium difficulty) math sum to solve each time I want to pick up the phone. (this extra barrier will ensure over time, unintentional and mindless phone usage reduces.)",
    "replies": 25,
    "retweets": 25,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2021-03-11T03:38:47.000Z",
    "text": "If a project seems stupidly ambitious but your heart desires it, start taking stupidly tiny steps towards it every day. When each step is a breeze, distances shrink.",
    "replies": 11,
    "retweets": 11,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2019-04-26T05:09:15.000Z",
    "text": "Here's an idea: give Earth a legal status just like corporations. Then Earth should be able to sue oil companies for the unauthorised use of its resources and demand compensation. Earth can deploy this 'revenue' to ensure that it doesn't die as an entity.",
    "replies": 12,
    "retweets": 12,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2020-11-30T09:55:41.000Z",
    "text": "One good skill to sharpen as an entrepreneur is to take a successful company and try to dissect from first principles what prevents some other company from eating its lunch.",
    "replies": 9,
    "retweets": 9,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2022-05-22T14:32:39.000Z",
    "text": "Here’s an idea to reimagine arranged marriages. 1. Interview happy couples with decades of marriage and divorced couples to build a predictive model of successful marriage 2. Use the model to match people 3. Bundle professional photo shoot to counter the biases everyone has",
    "replies": 31,
    "retweets": 31,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2025-03-19T13:31:03.000Z",
    "text": "Has anyone tried doing this for seed-stage investing? For each incoming pitch, do an A/B test. Control: follow a rigorous process and invest carefully. Variant: invest randomly with a certain probability. What would be results of this in 5-10 years? My bet: equivalent.",
    "replies": 36,
    "retweets": 36,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2021-09-10T05:39:07.000Z",
    "text": "Idea: a book that details mistakes and mediocre work from geniuses in various fields to drive home the point that no one is perfect.",
    "replies": 8,
    "retweets": 8,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2025-03-31T12:39:01.000Z",
    "text": "build things constantly and talk about them don't compare yourself with peers benchmark your work with things that the people you admire create",
    "replies": 1,
    "retweets": 1,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2025-03-31T12:27:39.000Z",
    "text": "start building startups *while* in college",
    "replies": 1,
    "retweets": 1,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2021-03-09T04:02:27.000Z",
    "text": "One of my dream projects is to open a (physical) bookshop called PROFESSOR. It will only have books by university professors written for the general audience. The book shelves will be categorised like university deferments, but will host public talks on obscure topics.",
    "replies": 8,
    "retweets": 8,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2024-12-23T06:30:00.000Z",
    "text": "the entire society benefits when a few mad folks obsessively explore a fringe area of culture or knowledge. if everyone pursued utilitarian goals, our world will be a boring and poorer place.",
    "replies": 18,
    "retweets": 18,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2021-02-10T04:16:35.000Z",
    "text": "- Keep your expenses super-low (live with parents) - Build something >2x better than existing alternatives - Keep prototyping ideas until users start keeping you busy on an idea - Don’t raise money until you have unmanageable traction - Work hard but keep outside interests",
    "replies": 11,
    "retweets": 11,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2021-12-14T06:41:03.000Z",
    "text": "Preparing an interview script before you start hiring for a role is one of the highest ROI actions you can do. Don't wing an interview. Hiring mistakes are costly - they set back your projects by years, so make sure you invest time in defining exactly who you want to hire.",
    "replies": 4,
    "retweets": 4,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2018-04-16T04:07:09.000Z",
    "text": "1/ A thread on INCREASING your CHANCES of STARTUP SUCCESS. Startups become successful when multiple things 'click' together like a jigsaw puzzle.",
    "replies": 9,
    "retweets": 9,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2023-04-05T13:00:03.000Z",
    "text": "Are you an entrepreneur or trying to be one? All my 66 mental models for founders at one place. Link below",
    "replies": 17,
    "retweets": 17,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2024-10-05T08:29:28.000Z",
    "text": "My first community note on a totally random thing :) You can never guess what goes viral on X.",
    "replies": 3,
    "retweets": 3,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2025-04-05T07:12:28.000Z",
    "text": "- Sponsor brightest indian students for a trip to SF/China and co-work with their counterparties for a few weeks - Kickstart a program like Google Summer of Code, but one where bright indian students are paired with accomplished indian-origin researchers abroad to publish joint",
    "replies": 23,
    "retweets": 23,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2024-10-12T12:56:28.000Z",
    "text": "The more you immerse yourself in history, more you realise that nothing is unique, and that everything is a variation of what’s happened before.",
    "replies": 26,
    "retweets": 26,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2021-07-15T03:19:28.000Z",
    "text": "How to accomplish a lot without working your ass off? Have no deadlines for your projects but show up every day and work on what you want to accomplish. Even if it’s 5 mins / day, but pour yourself into your project every single day. Consistency > quantity of work.",
    "replies": 11,
    "retweets": 11,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2022-04-09T10:44:05.000Z",
    "text": "Idea: a service that calls you once you’ve finished reading a book and asks you to explain it in detail.",
    "replies": 38,
    "retweets": 38,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2024-04-21T16:27:33.000Z",
    "text": "Ambition often derives its energy from a subconscious need for approval from others. This is why wise people replace ambition with play & refuse to compete with others, making creation for its own sake the default way of life.",
    "replies": 22,
    "retweets": 22,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2022-05-26T10:43:32.000Z",
    "text": "Advice for engineers trying to build a startup. Do NOT write code until you've had so many conversations with potential customers that there's nothing surprising emerging from such calls anymore.",
    "replies": 14,
    "retweets": 14,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2021-12-10T07:33:49.000Z",
    "text": "As a startup, it's an amazing realization that big companies are structurally set up to do only incremental innovation. This means founders at smaller companies *need* to be much more ambitious at what they're aiming for because big companies will only improve incrementally.",
    "replies": 10,
    "retweets": 10,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2023-01-17T12:21:36.000Z",
    "text": "If you're confident of your ability to learn and iterate rapidly, you should attack a ridiculously big market with a niche angle. You'll start small but have the optionality to grow really big over time.",
    "replies": 9,
    "retweets": 9,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2024-03-24T12:30:02.000Z",
    "text": "One good way to sharpen your intuition to spot great startup ideas is to try to reverse engineer recent Y-combinator batches.p",
    "replies": 3,
    "retweets": 3,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2025-02-21T03:04:29.000Z",
    "text": "Steal this idea. An MVP builder where you input your idea and it cooks up a prototype + a landing page + a paid campaign to drive traffic. You simply input your idea + $100, and in a few days it tells you how strong the demand is.",
    "replies": 67,
    "retweets": 67,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2023-02-28T13:03:26.000Z",
    "text": "Steal this idea: a modern rotary phone as a digital detox device. You come home, open its top, and plug in your phone for charging. Any calls your phone gets will ring the rotary phone and you can answer them the traditional way.",
    "replies": 14,
    "retweets": 14,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2024-12-08T07:21:04.000Z",
    "text": "Steal this idea: Duolingo for curiosity and discovery. Take a photo of anything and get a surprising, juicy fact about it, making you learn something new everyday. (You can easily build this via vision language models!)",
    "replies": 17,
    "retweets": 17,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2022-04-15T02:46:35.000Z",
    "text": "Steal this idea. A T-shirt subscription service where it takes your top tweet of the month (by engagement), uses it as a caption for Dall-E to generate a new graphic that gets printed on the T-shirt. This way you get a unique T-shirt every month that nobody else has.",
    "replies": 22,
    "retweets": 22,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2022-05-27T02:33:19.000Z",
    "text": "Steal this idea. A service that lets you create a deefake version of yourself to join group video meetings where all you have to do is nod and smile, and do a little bit of banter. The same bot can then write a 2 minute summary of what you need to know from that 1 hour meeting.",
    "replies": 19,
    "retweets": 19,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2021-06-12T13:59:37.000Z",
    "text": "Steal this idea. An e-commerce story with only super high-quality products from Indian manufacturers / brands.",
    "replies": 60,
    "retweets": 60,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2019-05-06T15:43:09.000Z",
    "text": "Steal this idea: a website or an app where people can list things they want to give away for free, and others can search what things they can get from their neighbours for free (before they make a purchase).",
    "replies": 10,
    "retweets": 10,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2023-01-30T15:31:36.000Z",
    "text": "Steal this idea. A social media app where content creator’s name + photo is hidden in the timeline by default and is only revealed if the user interacts with the content. This would enable content to stand on its own merit w/o any bias.",
    "replies": 28,
    "retweets": 28,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2021-06-04T07:32:49.000Z",
    "text": "Steal this idea. An online book store that recommends a slightly more challenging book based on the set of books you've read so far. Good teachers present challenging material in the right order (easy-to-tough) and this can be built into an online recommender system.",
    "replies": 22,
    "retweets": 22,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2019-03-17T05:06:05.000Z",
    "text": "Steal this idea: Uber for volunteerism. You open the app and see hyper-local tasks from charities around you. In your free time you can go around the city doing those tasks. Charge a cut on donations, but connecting NGO proposed tasks with volunteers is free.",
    "replies": 6,
    "retweets": 6,
    "likes": 0,
    "url": "Unknown"
  },
  {
    "tweet_id": "Unknown",
    "timestamp": "2025-04-04T06:39:06.000Z",
    "text": "Steal this research idea. Hypothesis: it'll speed up *both* training and inference. - Modify next-token prediction task to predicting embeddings of several next paragraphs - This is a harder task, so loss will drop faster - At inference, decode embeddings in parallel",
    "replies": 14,
    "retweets": 14,
    "likes": 0,
    "url": "Unknown"
  }
]